{
  "prop162979910": {
    "address": "The Red House, Clayton Road, Jesmond, Newcastle upon Tyne",
    "price": "£895,000",
    "type": "End of Terrace",
    "beds": "6",
    "baths": "3",
    "images": "24",
    "description": "Thought to have been originally constructed circa 1908 and located in the heart of Brandling Village Conservation Area, this substantial and stylish family home is one of only a handful of examples of ‘Arts and Crafts’ inspired Edwardian architecture in the city. Ideally located in the heart of B...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop162958277": {
    "address": "Queens Terrace, Jesmond, NE2",
    "price": "£725,000",
    "type": "Semi-Detached",
    "beds": "4",
    "baths": "1",
    "images": "24",
    "description": "This impressive semi detached family home is located in the heart of Jesmond has 4 bedrooms, off street parking and a stunning west facing lawn garden.",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop163169954": {
    "address": "Adderstone Court, Adderstone Crescent, Jesmond, Newcastle upon Tyne",
    "price": "£400,000",
    "type": "Flat",
    "beds": "3",
    "baths": "2",
    "images": "11",
    "description": "This highly impressive three bedroom apartment is ideally set to the first floor of this exclusive and prestigious gated development of Adderstone Court, Jesmond. One of the most sought-after apartment developments within Newcastle, Adderstone Court is located on Adderstone Crescent, which boasts...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop163090652": {
    "address": "St. Georges Terrace, Jesmond, NE2",
    "price": "£295,000",
    "type": "Flat",
    "beds": "2",
    "baths": "2",
    "images": "21",
    "description": "This beautifully presented two bedroom, first floor apartment is ideally situated on St Georges Terrace.",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop149900510": {
    "address": "Eslington Terrace, Jesmond, Newcastle upon Tyne",
    "price": "£240,000",
    "type": "Flat",
    "beds": "2",
    "baths": "1",
    "images": "10",
    "description": "PERIOD FEATURES & NO ONWARD CHAIN! This two bedroom conversion apartment is ideally located on Eslington Terrace, right in the heart of Brandling Village Conservation Area, Jesmond! Eslington Terrace, situated close to the parade of shops on Clayton Road, Jesmond Metro Station as well as Exhibiti...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop161701709": {
    "address": "Osborne Road, Newcastle Upon Tyne, NE2",
    "price": "£220,000",
    "type": "Flat",
    "beds": "2",
    "baths": "2",
    "images": "13",
    "description": "Situated in the heart of Jesmond, this two-bedroom top-floor apartment offers a blend of modern living within a converted building comprising six individual flats. The property is ideal for first-time buyers, investors, or professionals seeking a vibrant urban lifestyle.",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop163169714": {
    "address": "Blythswood, Osborne Road, Jesmond, Newcastle Upon Tyne",
    "price": "£220,000",
    "type": "Flat",
    "beds": "2",
    "baths": "1",
    "images": "13",
    "description": "An immaculate two-bedroom flat, based on the raised ground floor in Blythswood. The property is located in a highly sought-after location, boasting close proximity to public transport links, the Nuffield Hospital, and a variety of shops on Clayton Road. The property's interior is just as imp...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop162937097": {
    "address": "Helmsley Road, Sandyford",
    "price": "£150,000",
    "type": "Ground Flat",
    "beds": "2",
    "baths": "1",
    "images": "6",
    "description": "This spacious two-bedroom, ground floor flat is positioned in a popular area in Sandyford and is an ideal purchase for the first time buyer or buy to let investor. The property features a welcoming entrance hallway, generous main bedroom with fitted wardrobes and a bay window, second be...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop148617443": {
    "address": "Springbank Road, Sandyford, Newcastle Upon Tyne, NE2",
    "price": "£145,000",
    "type": "Apartment",
    "beds": "1",
    "baths": "1",
    "images": "7",
    "description": "Dating from circa 1901 and originally constructed as The Vicarage for the former St Barnabas Church, this fine period property was converted into apartments early in the millennium. The location is notable, close to Sandyford’s cafes and restaurants, within walking distance of the green spa...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop160157333": {
    "address": "Deneside Court, Jesmond, NE2",
    "price": "£145,000",
    "type": "Apartment",
    "beds": "2",
    "baths": "1",
    "images": "18",
    "description": "Superb first floor apartment within sought-after Deneside Court in Jesmond. Perfectly positioned for first-time buyers, professionals, or those looking to downsize, this beautifully presented home offers a harmonious blend of modern comfort and lovely surroundings. Ideally situ...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop160832174": {
    "address": "St. Georges Terrace, Jesmond, Newcastle Upon Tyne",
    "price": "£139,000",
    "type": "Flat",
    "beds": "1",
    "baths": "1",
    "images": "13",
    "description": "Presenting an immaculate duplex property, situated in a highly sought-after location of St George' Terrace, Jesmond. This property is perfectly suited for first-time buyers or investors alike, offering a unique open-plan layout that seamlessly combines the reception room and kitchen, into a har...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop161662022": {
    "address": "St Georges Terrace, Jesmond, Newcastle Upon Tyne, NE2",
    "price": "£130,000",
    "type": "Apartment",
    "beds": "1",
    "baths": "1",
    "images": "15",
    "description": "Located in a highly sought-after area, this well-presented top-floor apartment offers the perfect blend of comfort, convenience, and modern living. Ideally positioned for access to Jesmond’s vibrant mix of shops, bars, and restaurants, this property provides an exceptional lifestyle...",
    "timestamp": "2025-06-11T18:32:33Z"
  },
  "prop163172408": {
    "address": "Adderstone Crescent, Newcastle Upon Tyne",
    "price": "£120,000",
    "type": "Flat",
    "beds": "1",
    "baths": "1",
    "images": "12",
    "description": "A beautiful second floor apartment, overlooking the rear gardens within this desirable development in the heart of Jesmond. The property is ideally located close to local amenities, including Waitrose and the Acorn Road shopping facilities. The development of Russell Court, was originally constru...",
    "timestamp": "2025-06-11T18:32:33Z"
  }
}