{
  "prop166266698": {
    "address": "Craignethan, Mitchell Avenue, Jesmond, Newcastle Upon Tyne",
    "price": "£1,800,000",
    "type": "Detached",
    "beds": "6",
    "baths": "3",
    "images": "23",
    "description": "Available with no onward chain! Craignethan provides a fabulous, six bedroom, three storey detached house, constructed in 1906, located in a prime residential area of Jesmond with good accessibility to local amenities including independent shops, cafés and restaurants as well as some of...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166266698"
  },
  "prop166203584": {
    "address": "Glastonbury Grove, Jesmond, NE2",
    "price": "£850,000",
    "type": "Semi-Detached",
    "beds": "4",
    "baths": "1",
    "images": "31",
    "description": "Beautiful Semi-Detached Family Home Positioned on the Prestigious Glastonbury Grove in the Heart of the Jesmond Dene Conservation Area. Featuring Extensive Landscaped Mature Gardens, Two Reception Rooms, Kitchen/Breakfast Room, Private Driveway with Garage, and Exceptional Potential for Further D...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166203584"
  },
  "prop166352984": {
    "address": "Lily Avenue, Jesmond, NE2",
    "price": "£625,000",
    "type": "Terraced",
    "beds": "5",
    "baths": "2",
    "images": "19",
    "description": "This three storey mid terraced period family home is located in Jesmond, retains many original features, enjoys large room sizes, high ceilings & will appeal to a wide range of buyers.",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166352984"
  },
  "prop166214777": {
    "address": "Princess Mary Court, Jesmond, Newcastle upon Tyne",
    "price": "£595,000",
    "type": "Apartment",
    "beds": "3",
    "baths": "2",
    "images": "16",
    "description": "With no onward chain, this light and airy three-bedroom ground-floor mezzanine apartment is situated within the Phillipson Memorial building, part of the exclusive Princess Mary Court development, Jesmond. Ideally positioned for easy access to Clayton and Acorn Road with their shops and cafés, i...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166214777"
  },
  "prop166317947": {
    "address": "Myrtle Grove, Jesmond, NE2",
    "price": "£450,000",
    "type": "End of Terrace",
    "beds": "5",
    "baths": "2",
    "images": "19",
    "description": "This 3 storey end terraced period family home is located in the heart of Jesmond with versatile and generous accommodation that will suit a wide range of buyers and has access throughout the city.",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166317947"
  },
  "prop166326017": {
    "address": "Stratford Grove West, Sandyford, Newcastle Upon Tyne",
    "price": "£375,000",
    "type": "Maisonette",
    "beds": "6",
    "baths": "3",
    "images": "22",
    "description": "Bowson are pleased to present this exceptional six-bedroom HMO investment property, ideally located on Stratford grove west in the highly sought-after Sandyford area, NE2, one of Newcastle’s most desirable student locations.",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166326017"
  },
  "prop166184486": {
    "address": "Dulerton Court, Adderstone Crescent, Jesmond, Newcastle upon Tyne",
    "price": "£240,000",
    "type": "Flat",
    "beds": "2",
    "baths": "1",
    "images": "11",
    "description": "With Open Aspect Views Over Jesmond Dene & No Onward Chain! Tucked behind St George’s Church and ideally located within Dulverton Court, Adderstone Crescent. Arguably one of Newcastle’s most prestigious residential addresses, Adderstone Crescent, within Jesmond Dene Conservation Area is perfectly...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166184486"
  },
  "prop166269101": {
    "address": "Osborne Road, Jesmond, Newcastle Upon Tyne",
    "price": "£225,000",
    "type": "Flat",
    "beds": "1",
    "baths": "1",
    "images": "9",
    "description": "A stylish and refurbished, one bedroom ground floor apartment, positioned in the heart of Jesmond, only minutes from the cosmopolitan bars, restaurants and boutique shopping located on Osborne and Acorn Road. The conversion apartment with a new contemporary fitted shower room/wc, is ideal for ...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166269101"
  },
  "prop166305878": {
    "address": "Osborne Road, Jesmond, Newcastle-Upon-Tyne, NE2",
    "price": "£185,000",
    "type": "Apartment",
    "beds": "2",
    "baths": "1",
    "images": "8",
    "description": "Deceptively Spacious Two Bedroom, Two Bathroom, Ground Floor Apartment with Off-Street Parking in the Heart of Jesmond Welcome to 81B Osborne Road, a beautifully presented two-bedroom, two-bathroom ground floor apartment, ideally located in the vibrant heart of Jesmond. Offering genero...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166305878"
  },
  "prop166315871": {
    "address": "Starbeck Mews, Sandyford, Newcastle Upon Tyne, NE2",
    "price": "£175,000",
    "type": "Terraced",
    "beds": "2",
    "baths": "1",
    "images": "13",
    "description": "A two bedroom modern terraced house, well located for access to local Sandyford amenities, and Newcastle City Centre. Enjoying a well maintained interior, the house includes an Entrance Porch, a Living Room, a Kitchen, a First Floor Landing, two well proportioned Bedrooms each with built-in wardr...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166315871"
  },
  "prop166316183": {
    "address": "Portland Mews, Sandyford, Newcastle Upon Tyne",
    "price": "£160,000",
    "type": "Terraced",
    "beds": "2",
    "baths": "1",
    "images": "10",
    "description": "NO ONWARD CHAIN! Priced to reflect cosmetic updating, this two bedroom mid-terrace home is ideally located within Portland Mews, in the ever-popular suburb of Sandyford. Tucked just off Helmsley Road, Portland Mews is situated within close proximity to Newcastle City Centre, the nightlife and sho...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166316183"
  },
  "prop166347224": {
    "address": "Lonsdale Court, West Jesmond, Newcastle upon Tyne",
    "price": "£139,950",
    "type": "Flat",
    "beds": "2",
    "baths": "1",
    "images": "10",
    "description": "Manson's are delighted to bring to the sales market this two bedroom, first floor flat at the popular Lonsdale Court development in West Jesmond. Just a short distance from Newcastle City Centre, Jesmond boasts excellent public transport connections. The area offers a lively mix of bars, restaura...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166347224"
  },
  "prop161402081": {
    "address": "Deneside Court, Newcastle upon Tyne, Tyne and Wear, NE2",
    "price": "£129,950",
    "type": "Flat",
    "beds": "2",
    "baths": "1",
    "images": "13",
    "description": "The City and Suburb sales team are delighted to bring this stunning ground floor, two bedroom flat located in the superbly located Deneside Court to the market.",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/161402081"
  },
  "prop166309463": {
    "address": "Deuchar House, Sandyford Road, Newcastle Upon Tyne",
    "price": "£110,000",
    "type": "Apartment",
    "beds": "2",
    "baths": "1",
    "images": "14",
    "description": "Hive Estates is delighted to present this beautiful two-bedroom apartment, situated on the second floor of the iconic Deuchar House in Sandyford, Newcastle upon Tyne. This stunning Grade II listed building has been sympathetically converted into modern apartments, offering a rare opportunity to o...",
    "timestamp": "2025-08-29T12:50:26Z",
    "link": "https://www.rightmove.co.uk/properties/166309463"
  }
}