{
  "prop160157333": {
    "address": "Deneside Court, Jesmond, NE2",
    "price": "£145,000",
    "type": "Apartment",
    "beds": "2",
    "baths": "1",
    "images": "18",
    "description": "Superb first floor apartment within sought-after Deneside Court in Jesmond. Perfectly positioned for first-time buyers, professionals, or those looking to downsize, this beautifully presented home offers a harmonious blend of modern comfort and lovely surroundings. Ideally situ..."
  },
  "prop160832174": {
    "address": "St. Georges Terrace, Jesmond, Newcastle Upon Tyne",
    "price": "£139,000",
    "type": "Flat",
    "beds": "1",
    "baths": "1",
    "images": "13",
    "description": "Presenting an immaculate duplex property, situated in a highly sought-after location of St George' Terrace, Jesmond. This property is perfectly suited for first-time buyers or investors alike, offering a unique open-plan layout that seamlessly combines the reception room and kitchen, into a har..."
  },
  "prop161662022": {
    "address": "St Georges Terrace, Jesmond, Newcastle Upon Tyne, NE2",
    "price": "£130,000",
    "type": "Apartment",
    "beds": "1",
    "baths": "1",
    "images": "15",
    "description": "Located in a highly sought-after area, this well-presented top-floor apartment offers the perfect blend of comfort, convenience, and modern living. Ideally positioned for access to Jesmond’s vibrant mix of shops, bars, and restaurants, this property provides an exceptional lifestyle..."
  },
  "prop162937097": {
    "address": "Helmsley Road, Sandyford",
    "price": "£150,000",
    "type": "House",
    "beds": "2",
    "baths": "1",
    "images": "6",
    "description": "This spacious two-bedroom, ground floor flat is positioned in a popular area in Sandyford and is an ideal purchase for the first time buyer or buy to let investor. The property features a welcoming entrance hallway, generous main bedroom with fitted wardrobes and a bay window, second be..."
  },
  "prop162958277": {
    "address": "Queens Terrace, Jesmond, NE2",
    "price": "£725,000",
    "type": "Semi-Detached",
    "beds": "4",
    "baths": "1",
    "images": "24",
    "description": "This impressive semi detached family home is located in the heart of Jesmond has 4 bedrooms, off street parking and a stunning west facing lawn garden."
  },
  "prop162979910": {
    "address": "The Red House, Clayton Road, Jesmond, Newcastle upon Tyne",
    "price": "£895,000",
    "type": "End of Terrace",
    "beds": "6",
    "baths": "3",
    "images": "24",
    "description": "Thought to have been originally constructed circa 1908 and located in the heart of Brandling Village Conservation Area, this substantial and stylish family home is one of only a handful of examples of ‘Arts and Crafts’ inspired Edwardian architecture in the city. Ideally located in the heart of B..."
  }
}